apache/nuttx/arch/risc-v/src/hpm6000/hardware/hpm6300/hpm6300_ioc.h
#define HPM_IOC_PAD_PA00_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA00_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA00_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA00_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA01_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA01_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA01_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA01_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA02_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA02_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA02_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA02_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA03_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA03_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA03_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA03_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA04_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA04_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA04_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA04_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA05_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA05_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA05_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA05_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA06_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA06_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA06_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA06_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA07_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA07_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA07_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA07_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA08_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA08_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA08_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA08_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA09_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA09_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA09_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA09_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA10_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA10_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA10_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA10_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA11_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA11_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA11_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA11_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA12_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA12_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA12_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA12_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA13_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA13_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA13_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA13_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA14_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA14_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA14_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA14_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA15_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA15_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA15_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA15_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA16_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA16_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA16_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA16_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA17_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA17_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA17_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA17_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA18_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA18_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA18_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA18_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA19_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA19_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA19_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA19_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA20_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA20_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA20_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA20_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA21_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA21_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA21_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA21_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA22_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA22_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA22_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA22_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA23_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA23_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA23_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA23_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA24_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA24_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA24_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA24_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA25_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA25_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA25_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA25_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA26_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA26_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA26_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA26_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA27_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA27_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA27_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA27_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA28_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA28_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA28_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA28_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA29_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA29_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA29_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA29_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA30_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA30_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA30_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA30_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PA31_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PA31_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PA31_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PA31_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB00_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB00_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB00_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB00_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB01_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB01_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB01_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB01_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB02_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB02_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB02_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB02_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB03_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB03_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB03_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB03_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB04_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB04_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB04_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB04_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB05_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB05_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB05_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB05_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB06_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB06_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB06_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB06_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB07_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB07_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB07_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB07_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB08_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB08_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB08_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB08_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB09_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB09_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB09_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB09_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB10_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB10_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB10_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB10_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB11_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB11_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB11_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB11_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB12_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB12_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB12_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB12_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB13_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB13_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB13_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB13_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB14_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB14_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB14_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB14_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB15_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB15_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB15_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB15_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB16_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB16_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB16_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB16_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB17_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB17_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB17_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB17_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB18_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB18_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB18_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB18_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB19_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB19_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB19_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB19_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB20_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB20_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB20_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB20_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB21_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB21_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB21_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB21_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB22_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB22_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB22_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB22_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB23_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB23_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB23_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB23_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB24_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB24_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB24_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB24_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB25_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB25_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB25_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB25_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB26_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB26_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB26_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB26_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB27_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB27_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB27_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB27_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB28_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB28_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB28_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB28_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB29_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB29_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB29_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB29_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB30_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB30_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB30_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB30_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PB31_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PB31_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PB31_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PB31_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC00_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC00_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC00_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC00_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC01_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC01_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC01_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC01_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC02_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC02_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC02_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC02_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC03_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC03_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC03_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC03_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC04_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC04_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC04_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC04_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC05_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC05_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC05_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC05_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC06_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC06_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC06_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC06_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC07_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC07_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC07_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC07_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC08_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC08_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC08_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC08_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC09_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC09_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC09_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC09_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC10_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC10_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC10_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC10_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC11_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC11_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC11_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC11_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC12_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC12_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC12_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC12_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC13_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC13_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC13_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC13_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC14_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC14_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC14_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC14_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC15_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC15_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC15_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC15_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC16_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC16_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC16_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC16_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC17_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC17_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC17_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC17_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC18_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC18_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC18_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC18_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC19_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC19_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC19_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC19_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC20_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC20_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC20_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC20_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC21_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC21_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC21_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC21_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC22_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC22_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC22_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC22_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC23_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC23_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC23_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC23_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC24_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC24_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC24_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC24_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC25_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC25_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC25_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC25_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC26_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC26_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC26_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC26_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PC27_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PC27_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PC27_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PC27_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX00_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX00_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX00_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX00_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX01_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX01_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX01_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX01_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX02_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX02_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX02_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX02_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX03_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX03_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX03_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX03_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX04_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX04_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX04_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX04_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX05_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX05_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX05_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX05_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX06_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX06_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX06_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX06_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PX07_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PX07_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PX07_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PX07_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY00_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY00_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY00_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY00_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY01_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY01_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY01_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY01_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY02_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY02_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY02_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY02_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY03_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY03_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY03_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY03_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY04_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY04_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY04_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY04_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY05_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY05_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY05_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY05_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY06_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY06_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY06_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY06_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PY07_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PY07_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PY07_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PY07_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ00_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ00_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ00_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ00_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ01_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ01_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ01_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ01_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ02_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ02_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ02_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ02_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ03_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ03_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ03_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ03_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ04_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ04_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ04_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ04_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ05_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ05_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ05_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ05_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ06_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ06_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ06_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ06_PAD_CTL_OFFSET )
#define HPM_IOC_PAD_PZ07_FUNC_CTL          (HPM_IOC_BASE + HPM_IOC_PAD_PZ07_FUNC_CTL_OFFSET)
#define HPM_IOC_PAD_PZ07_PAD_CTL           (HPM_IOC_BASE + HPM_IOC_PAD_PZ07_PAD_CTL_OFFSET )

#define HPM_PIOC_PAD_FUNC_CTL_ADDRESS(n)   (HPM_PIOC_BASE + HPM_IOC_PAD_FUNC_CTL_OFFSET(n))
#define HPM_PIOC_PAD_PAD_CTL_ADDRESS(n)    (HPM_PIOC_BASE + HPM_IOC_PAD_PAD_CTL_OFFSET(n))

#define HPM_PIOC_PAD_PY00_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY00_FUNC_CTL_OFFSET)
#define HPM_PIOC_PAD_PY01_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY01_FUNC_CTL_OFFSET)
#define HPM_PIOC_PAD_PY02_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY02_FUNC_CTL_OFFSET)
#define HPM_PIOC_PAD_PY03_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY03_FUNC_CTL_OFFSET)
#define HPM_PIOC_PAD_PY04_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY04_FUNC_CTL_OFFSET)
#define HPM_PIOC_PAD_PY05_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY05_FUNC_CTL_OFFSET)
#define HPM_PIOC_PAD_PY06_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY06_FUNC_CTL_OFFSET)
#define HPM_PIOC_PAD_PY07_FUNC_CTL         (HPM_PIOC_BASE + HPM_IOC_PAD_PY07_FUNC_CTL_OFFSET)

#endif /* __ARCH_RISCV_SRC_HPM6000_HARDWARE_HPM6300_HPM6300_IOC_H */
